src/test/resources/soap/ignored-courts.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope"
  xmlns:ns35="http://www.justice.gov.uk/magistrates/external/ExternalDocumentRequest">
  <soap:Header xmlns:wsa="http://www.w3.org/2005/08/addressing">
    <wsa:Action>externalDocument</wsa:Action>
    <wsa:From>
      <wsa:Address>CP_NPS_ML</wsa:Address>
    </wsa:From>
    <wsa:MessageID>09233523-345b-4351-b623-5dsf35sgs5d6</wsa:MessageID>
    <wsa:RelatesTo>RelatesToValue</wsa:RelatesTo>
    <wsa:To>CP_NPS</wsa:To>
  </soap:Header>
  <soap:Body>
    <ns35:ExternalDocumentRequest>
      <documents>
        <document>
          <info>
            <general />
            <source_file_name>5_26102020_2992_B10XX00_ADULT_COURT_LIST_DAILY</source_file_name>
            <printers/>
            <parameters />
            <start_time>09:05:04</start_time>
          </info>
          <data />
        </document>
      </documents>
    </ns35:ExternalDocumentRequest>
  </soap:Body>
</soap:Envelope>
